{
    "paragraphs": [
        "Data is transferred between memory and cache in blocks of fixed size, called cache lines or cache blocks. When a cache line is copied from memory into the cache, a cache entry is created. The cache entry will include the copied data as well as the requested memory location (called a tag).",

        "When the processor needs to read or write a location in memory, it first checks for a corresponding entry in the cache. The cache checks for the contents of the requested memory location in any cache lines that might contain that address. If the processor finds that the memory location is in the cache, a cache hit has occurred. However, if the processor does not find the memory location in the cache, a cache miss has occurred. In the case of a cache hit, the processor immediately reads or writes the data in the cache line. For a cache miss, the cache allocates a new entry and copies data from main memory, then the request is fulfilled from the contents of the cache.",

        "A CPU cache is a hardware cache used by the central processing unit (CPU) of the computer to reduce an average cost (time or energy) to the access data from a main memory. A cache is a smaller, faster memory, located closer to a processor core, which stores copies of the data from frequently used main memory locations, avoiding the need to always refer to main memory which may be tens to hundreds of times slower to access.",

        "Cache memory is typically implemented with static random-access memory (SRAM), which requires multiple transistors to store a single bit. This makes it expensive in terms of the area it takes up, and in modern CPUs the cache is typically the largest part by chip area. The size of the cache needs to be balanced with the general desire for smaller chips which cost less. Some modern designs implement some or all of their cache using the physically smaller eDRAM, which is slower to use than SRAM but allows larger amounts of cache for any given amount of chip area.",

        "Most CPUs have the main hierarchy of multiple cache levels (L1, L2, often L3, and rarely even L4), with the separate instruction-specific (I-cache) and data-specific (D-cache) caches at level 1. The different levels are implemented in different areas of the chip; L1 is located as close to a CPU core as possible and thus offers the highest speed due to short signal paths, but requires careful design. L2 caches are physically separate from the CPU and operate slower, but place fewer demands on the chip designer and can be made much larger without impacting the CPU design. L3 caches are generally shared among multiple CPU cores.",
        
        "In computing, virtual memory, or virtual storage, is a memory management technique that provides an 'idealized abstraction of the storage resources that are actually available on a given machine' which 'creates the illusion to users of a very large (main) memory'.",
    
        "The primary benefits of virtual memory include freeing applications from having to manage a shared memory space, ability to share memory used by libraries between processes, increased security due to memory isolation, and being able to conceptually use more memory than might be physically available, using the technique of paging or segmentation.",
        
        "Page tables are used to translate the virtual addresses seen by the application into physical addresses used by the hardware to process instructions;[25] such hardware that handles this specific translation is often known as the memory management unit. Each entry in the page table holds a flag indicating whether the corresponding page is in real memory or not. If it is in real memory, the page table entry will contain the real memory address at which the page is stored. When a reference is made to a page by the hardware, if the page table entry for the page indicates that it is not currently in real memory, the hardware raises a page fault exception, invoking the paging supervisor component of the operating system.",
    
        "Virtual memory is an integral part of a modern computer architecture; implementations usually require hardware support, typically in the form of a memory management unit built into the CPU. While not necessary, emulators and virtual machines can employ hardware support to increase performance of their virtual memory implementations.",
    
        "Virtual memory makes application programming easier by hiding fragmentation of physical memory; by delegating to the kernel the burden of managing the memory hierarchy (eliminating the need for the program to handle overlays explicitly); and, when each process is run in its own dedicated address space, by obviating the need to relocate program code or to access memory with relative addressing.",

        "The water cycle is a biogeochemical cycle that involves the continuous movement of water on, above and below the surface of the Earth across different reservoirs. The mass of water on Earth remains fairly constant over time. However, the partitioning of the water into the major reservoirs of ice, fresh water, salt water and atmospheric water is variable and depends on climatic variables. The water moves from one reservoir to another, such as from river to ocean, or from the ocean to the atmosphere due to a variety of physical and chemical processes. The processes that drive these movements, or fluxes, are evaporation, transpiration, condensation, precipitation, sublimation, infiltration, surface runoff, and subsurface flow. In doing so, the water goes through different phases: liquid, solid (ice) and vapor. The ocean plays a key role in the water cycle as it is the source of 86% of global evaporation.",
    
        "The water cycle is driven by energy exchanges in the form of heat transfers between different phases. The energy released or absorbed during a phase change can result in temperature changes. Heat is absorbed as water transitions from the liquid to the vapor phase through evaporation. This heat is also known as the latent heat of vaporization. Conversely, when water condenses or melts from solid ice it releases energy and heat. On a global scale, water plays a critical role in transferring heat from the tropics to the poles via ocean circulation.",

        "The evaporative phase of the cycle also acts as a purification process by separating water molecules from salts and other particles that are present in its liquid phase. The condensation phase in the atmosphere replenishes the land with freshwater. The flow of liquid water transports minerals across the globe. It also reshapes the geological features of the Earth, through processes of weathering, erosion, and deposition. The water cycle is also essential for the maintenance of most life and ecosystems on the planet.",

        "The water cycle is powered by the energy emitted from the sun. There are several ways in which this is accomplished, one of the first ways is through evaporation where the energy from the sun heats the water in oceans, lakes, streams, rivers, seas, ponds, etc. and that water goes through a phase change to become a gas (water vapor) that goes up into the atmosphere. Two other ways that water gets into the atmosphere is through snow and ice sublimating into water vapor and through evapotranspiration which is water transpired from plants and evaporated from the soil.",
    
        "Clouds form because water molecules have a smaller molecular mass than the major gas components of the atmosphere (oxygen, O2; and nitrogen, N2); this smaller molecular mass leads to water having a lower density which drives the water molecules higher up in the atmosphere due to buoyancy. However, as altitude increases, air pressure decreases which causes a drop in temperature. The lower temperature forces the water vapor to go through another phase change, this time it forces it to condense into liquid water droplets which are supported by an updraft; if there is enough of these water droplets over a large area, it is considered a cloud. Condensation of the water vapour closer to the ground level is referred to as fog.",
    
        "Agriculture is the practice of cultivating the soil, planting, raising, and harvesting both food and non-food crops, as well as livestock production. Broader definitions also include forestry and aquaculture. Agriculture was a key factor in the rise of sedentary human civilization, whereby farming of domesticated plants and animals created food surpluses that enabled people to live in the cities. While humans started gathering grains at least 105,000 years ago, nascent farmers only began planting them around 11,500 years ago. Sheep, goats, pigs, and cattle were domesticated around 10,000 years ago. Plants were independently cultivated in at least 11 regions of the world. In the 20th century, industrial agriculture based on large-scale monocultures came to dominate agricultural output.",

        "As of 2021, small farms, of which the vast majority are one hectare (about 2.5 acres) or smaller, produce about one-third of the world's food. Moreover, five of every six farms in the world consist of fewer than 2 hectares (4.9 acres) and take up only around 12% of all agricultural land. In terms of total land use, large farms are dominant. While only 1% of all farms globally are greater than 50 hectares (120 acres), they encompass more than 70% of the world's farmland. Further, nearly 40% of all global agricultural land is found on farms larger than 1,000 hectares (2,500 acres).",

        "Farms and farming greatly influence rural economics and greatly shape rural society, affecting both the direct agricultural workforce and broader businesses that support the farms and farming populations.",

        "The major agricultural products can be broadly grouped into foods, fibers, fuels, and raw materials (such as rubber and timber). Food classes include cereals (grains), vegetables, fruits, cooking oils, meat, milk, eggs, and fungi. Global agricultural production amounts to approximately 11 billion tonnes of food, 32 million tonnes of natural fibers and 4 billion m3 of wood. However, around 14% of the world's food is lost from production before reaching the retail level.",

        "Modern agronomy, plant breeding, agrochemicals such as pesticides and fertilizers, and technological developments have sharply increased crop yields, but also contributed to ecological and environmental damage. Selective breeding and modern practices in animal husbandry have similarly increased the output of meat, but have raised concerns about animal welfare and environmental damage. Environmental issues include contributions to climate change, depletion of aquifers, deforestation, antibiotic resistance, and other agricultural pollution. Agriculture is both a cause of and sensitive to environmental degradation, such as biodiversity loss, desertification, soil degradation, and climate change, all of which can cause decreases in crop yield. Genetically modified organisms are widely used, although some countries ban them."
    ]
        
}
